tests/XMP/XMP_XFW007/Provisioning-API/ProvisioningSettingsWebServicesAPI/setSubscriberFilter-existingSubscriber.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://policy.intf.mobixell.com/">
  <soap:Body>
    <tns:setSubscriberFilter>
      <arg0>100003</arg0>
      <arg1>
        <scheme>2</scheme>
        <blockedCategories>Gambling</blockedCategories>
        <blockedUrls>http://poker*.com</blockedUrls>
        <exceptionUrls>http://poker123.com</exceptionUrls>
      </arg1>
    </tns:setSubscriberFilter>
  </soap:Body>
</soap:Envelope>
